import re

test_str = ['Колонтитул-Титул К. К. К. К. P3118\nБольшой-Пребольшой Б. Б. P3118\n'
            'Гадкий Г. Г. P3116\nСтранный В. В. P3118\nХрущ Д. Р. P3113',

            'Блин-Блинский Н. Г. P3118\nМоцарт В. А. P3118\nПудж С. С. P3119\n'
            'Ягодка Я. Я. P3118\nСтрашилка С. С. P3115\nГрязюка Т. М. P3118',

            'Шрек Ш. Ш. Ш. P3118\nОсёл О. О. P3118\nКот К. К. P3118\nФиона Ф. Ф. P3118',

            'Феминист К. А. P3119\nПарикмахер К. А. P3118\nПисатель К. А. P3117\nАктивист К. А. P3116',

            'Деревня-Дураков Д. Д. P3116\nКард-Бланш К. К. P3118\nТак-Одиноко О. К. P3114\n'
            'Виктор В. В. P3118\nЧто М. М. P3118\nНичего Н. Н. P3118']

pattern = r'[А-ЯA-ZЁ]+[а-яa-zёЁ]+(\-[А-ЯA-ZЁ]+[а-яa-zё]+)*\s([А-ЯA-ZЁ]\.\s)\2*P3118'
test = 0
for current_table in test_str:
    test += 1
    current_list = current_table.split('\n')
    for i in range(len(current_list)):
        current_list[i] = re.sub(pattern, '', current_list[i])

    print(f'Список студентов для теста #{test}:')
    f = 0
    for i in current_list:
        if i:
            print(i)
            f = 1
    if f == 0:
        print('Никого не осталось...')
    print()

